app/controllers/recipes_controller.rb

	def index
		@user = User.find(params[:user_id])
		@pantry = Pantry.find(params[:pantry_id])
		@items = @pantry.items.order(:expiration_date).limit(3)
		@recipes = Yummly.search("#{@items[0].name} #{@items[1].name}").sort {|a, b| b.rating <=> a.rating}
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "pantries".* FROM "pantries"  WHERE "pantries"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "items".* FROM "items"  WHERE "items"."pantry_id" = $1  ORDER BY "items"."expiration_date" ASC LIMIT 3  [["pantry_id", 1]]
SELECT  "items".* FROM "items"  WHERE "items"."pantry_id" = $1  ORDER BY expiration_date LIMIT 5  [["pantry_id", 1]]