app/controllers/users_controller.rb

	def show
		show_door #need to check if the logged-in user owns the profile
		@user = User.find(params[:id])
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 3 LIMIT 1

	def create
		@user = User.create!(user_params)
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def login
		@user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users"  WHERE "users"."email" = 'syoon@gmail.com' LIMIT 1